Autodesk.Navisworks.Api.DocumentInfo
Information about a Autodesk.Navisworks.Api.Document that can be accessed without loading the entire document

Autodesk.Navisworks.Api.DocumentInfo.#ctor
Create an empty DocumentInfoAutodesk.Navisworks.Api.DocumentInfo

Autodesk.Navisworks.Api.DocumentInfo.CurrentSheet
Get the currently active sheet
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.DocumentInfo.CurrentSheetId
Get the id of the currently active sheet
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.DocumentInfo.FileVersionGuid
Get Guid generated when current version of corresponding file was saved. Changes whenever document is saved.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.DocumentInfo.FindSheet(System.String)
Find Sheet by sheet Id
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.DocumentInfo.IndexOfSheetId(System.String)
Get Index by sheet Id
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.DocumentInfo.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.DocumentInfo.PropertyCategories
Get the property category collection
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.DocumentInfo.SourceGuid
Get original Guid when FileInfo was first created. Once set remains the same while Guid changes when saving to a file of a different type.
Throws System.ObjectDisposedException:
Object has been Disposed